export const regList = {
    imgCode: /^[0-9a-zA-Z]{4}$/, //图片验证码是否4位数
    smsCode: /^\d{4}$/, //短信验证码是否4位数字
    mailCode: /^\d{4}$/, //邮件验证码是否4位数字
    userName: /^.{2,16}$/, //用户名4-16位
    password: /^[\w!@#$%^&*.]{6,16}$/, //密码6-16位
    mobile: /^1[3|4|5|7|8]\d{9}$/, //手机号格式
    bankNum: /^\d{10,19}$/, //银行卡号码格式
    answer: /^\S+$/, //非空白字符
    mail: /^([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/, //邮箱格式
    number: /^\d+$/, //必须数字
    phone: /^[0-9,\-]*$/, //必须电话格式
    time: /^([0-1]?[0-9]|2[0-3]):([0-5][0-9]):([0-5][0-9])$/,
    identity:/(^\d{15}$)|(^\d{17}([0-9]|X)$)/
}